Revit 2024 API
RebarShape.GetCurvesForBrowser Method
 Generate curves for the shape, as used in the shape browser.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2009
Syntax
C#
public IList<Curve> GetCurvesForBrowser()
Visual Basic
Public Function GetCurvesForBrowser As IList(Of Curve)
Visual C++
public:
IList<Curve^>^ GetCurvesForBrowser()
Return Value
 An array of curves representing the shape with its default parameters.
See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace